{
  "teoria": "Teoria",
  "grafy": "Grafy",
  "macierze": "Macierze",
  "header": "Wizaualizacja Łańcuchów Markova",
  "macierzIWektor": "Macierz i Wektor",
  "iloscKolumnIWierszy": "Liczba stanów łańcucha Markowa",
  "macierz": "Macierz przejść",
  "wektor": "Wektor",
  "obliczPrawdopodobienstwoFinalne": "Oblicz prawdopodobienstwo finalne",
  "obliczPrawdopodobieństwoPoNKrokach": "Oblicz prawdopodobieństwo po n krokach",
  "obliczPrawdopodobieństwoStacjonarne": "Oblicz prawdopdobieństo stacjonarne",
  "stanPochlaniajacy": "Stan pochłaniający",
  "matrix_tooltip": "Macierz przejść w łańcuchu Markowa to dwuwymiarowa tablica, gdzie każdy element reprezentuje prawdopodobieństwa przejścia z jednego stanu do drugiego. Każdy wiersz macierzy odpowiada stanowi początkowemu, a każda kolumna stanowi docelowemu. Wartość w danym elemencie mówi nam, jakie jest prawdopodobieństwo przejścia z danego stanu początkowego do stanu docelowego.",
  "initial_vector_tooltip": "Wektor początkowy w łańcuchu Markowa to jednowymiarowy zestaw wartości, który reprezentuje początkowe prawdopodobieństwa wystąpienia poszczególnych stanów w łańcuchu. Każdy element tego wektora odpowiada jednemu ze stanów w łańcuchu Markowa. Przemnażając ten wektor przez macierz przejść, otrzymujemy nowy wektor, który reprezentuje prawdopodobieństwa wystąpienia stanów w kolejnym kroku czasowym.",
  "rowsAndCols_description" : "Ilość kolumn w macierzy przejścia w łańcuchu Markowa odpowiada liczbie możliwych stanów, jakie może przyjąć dany proces. Każda kolumna reprezentuje jeden z tych stanów. Z kolei ilość wierszy odpowiada również liczbie stanów. Liczba kolumn i wierszy w macierzy przejścia jest opisem struktury łańcucha Markowa, gdzie kolumny reprezentują stany, a wiersze reprezentują prawdopodobieństwa przejścia między nimi.",
  "transition_probabilities_sum_description": "Suma prawdopodobieństw przejść dla każdego stanu (czyli dla każdego wiersza w macierzy przejść) musi wynosić 1. To oznacza, że każdy stan ma przypisane prawdopodobieństwo przejścia do innych stanów, a suma tych prawdopodobieństw dla danego stanu zawsze daje 1.",
  "markov_chains" : "Łańcuchy Markowa",
  "introduction_title": "Wprowadzenie do Łańcuchów Markowa",
  "markov_chains_introduction": "Łańcuchy Markowa są to procesy stochastyczne, w których przyszły stan systemu zależy wyłącznie od aktualnego stanu, a nie od całej historii procesu. Początkowo używane do modelowania losowych procesów, stały się popularnym narzędziem w różnych dziedzinach, takich jak informatyka, ekonomia, biologia itp.",
  "basic_concepts_title": "Podstawowe pojęcia",
  "state": "Stan:",
  "transition_matrix": "Macierz Przejść:",
  "transition_probability": "Prawdopodobieństwo przejścia:",
  "state_definition": "Każdy możliwy wynik procesu.",
  "transition_matrix_definition": "Macierz określająca prawdopodobieństwa przejść między stanami.",
  "transition_probability_definition": "Prawdopodobieństwo przejścia z jednego stanu do drugiego.",
  "markov_properties_title": "Własności Łańcuchów Markowa",
  "ergodicity": "Ergodyczność:",
  "ergodicity_description": "Łańcuch Markowa jest ergodyczny, jeśli można z każdego stanu osiągnąć każdy inny stan w skończonym czasie.",
  "stationarity": "Stacjonarność:",
  "stationarity_description": "Łańcuch Markowa osiąga stan stacjonarny, gdy rozkład prawdopodobieństwa nie zmienia się w czasie.",
  "applications_examples" : "Przykłady zastosowań",
  "finance": "Finanse",
  "social_sciences" : "Nauki społeczne",
  "biology": "Biologia",
  "engineering": "Inżynieria",
  "computer_science": "Informatyka",
  "telecommunications": "Telekomunikacja",
  "finance_description" : "Łańcuchy Markowa są używane do modelowania i prognozowania rynków finansowych, takich jak giełda papierów wartościowych. Mogą być stosowane do analizy zmienności cen akcji, prognozowania przyszłych cen i oceny ryzyka inwestycyjnego.",
  "social_sciences_description": "W socjologii i ekonomii behawioralnej można użyć łańcuchów Markowa do modelowania zachowań społecznych, takich jak wybory polityczne, preferencje konsumenckie i dynamika rynków pracy.",
  "biology_description": "Łańcuchy Markowa są stosowane do modelowania różnych procesów biologicznych, takich jak ewolucja genetyczna, cykle życiowe organizmów i dynamika populacji.",
  "engineering_description": "W inżynierii systemów i zarządzaniu produkcją łańcuchy Markowa mogą być używane do modelowania i optymalizacji procesów produkcyjnych, zarządzania zapasami, planowania tras w transporcie i analizy niezawodności systemów.",
  "computer_science_description": "W informatyce łańcuchy Markowa są używane w modelowaniu i analizie algorytmów wyszukiwania, analizie ruchu sieciowego, planowaniu zasobów w systemach komputerowych i wielu innych zastosowaniach.",
  "telecommunications_description": "W sieciach telekomunikacyjnych łańcuchy Markowa mogą być stosowane do modelowania ruchu, analizy przepływu danych, planowania pojemności i optymalizacji wydajności sieci.",
  "markov_visualization_title": "Wizualizacja Łańcucha Markowa",
  "weather_relations_description": "Poniższy schemat przedstawia relacje między różnymi stanami pogody, takimi jak słonecznie, pochmurno i deszczowo, uwzględniając także prawdopodobieństwa przejść pomiędzy nimi, wyrażone w procentach.",
  "fractional_relations_description": "Poniższy schemat przedstawia relacje między różnymi stanami S1,S2,S3,S4,S5  uwzględniając prawdopodobieństwa przejść pomiędzy nimi wyrażone w ułamkowo",
  "transition_matrix_description": "Macierz przejść opisująca dany łańcuch Markowa wygląda następująco:",
  "irreversible_state_description": "Stan niepowrotny S1 występuje jednorazowo, bez możliwości powrotu do niego",
  "absorbing_state_description": "Stan pochłaniający S3 po wejściu zostajemy w nim do końca",
  "summary_title": "Podsumowanie",
  "markov_chains_description": "Łańcuchy Markowa są potężnym narzędziem do modelowania losowych procesów, których zachowanie zależy od aktualnego stanu. Właściwością charakterystyczną łańcuchów Markowa jest to, że przyszły stan procesu zależy wyłącznie od bieżącego stanu, a nie od historii stanów, co sprawia, że są one użyteczne do modelowania wielu rzeczywistych sytuacji. Ich zastosowania są nieograniczone - od prognozowania cen akcji na giełdzie papierów wartościowych po modelowanie zachowań społecznych w naukach społecznych, a nawet analizę ruchu w sieciach telekomunikacyjnych. Poprzez analizę łańcuchów Markowa, naukowcy, analitycy i inżynierowie mogą wyciągać cenne wnioski dotyczące przyszłych stanów procesów, identyfikować trendy i wzorce oraz podejmować bardziej świadome decyzje."
}
